export default {
  th: {
    locale: 'th',
    messages: {
      'หน้าแรก': 'หน้าแรก',
      'ประกาศขาย - เช่า': 'ประกาศขาย - เช่า',
      'ค้นหานายหน้า': 'ค้นหานายหน้า',
      'ข่าวสารและบทความ': 'ข่าวสารและบทความ',
      'เว็บบอร์ด': 'เว็บบอร์ด',
      'เข้าสู่ระบบ': 'เข้าสู่ระบบ',
    }
  },
  en: {
    locale: 'en-US',
    messages: {
      'หน้าแรก': 'Home',
      'ประกาศขาย - เช่า': 'ประกาศขาย - เช่า',
      'ค้นหานายหน้า': 'ค้นหานายหน้า',
      'ข่าวสารและบทความ': 'ข่าวสารและบทความ',
      'เว็บบอร์ด': 'เว็บบอร์ด',
      'เข้าสู่ระบบ': 'เข้าสู่ระบบ',
    }
  }
}